{
    "projects": [
        {
            "id": 0,
            "project_name": "Random Quote Generator",
            "description": "An app that effortlessly presents you with a curated Disney quote at random. You have the choice to either click the 'Show another quote' button for immediate access to a new quote, or simply relax as the page automatically refreshes itself. A built-in timer ensures a fresh quote graces your screen every 10 seconds, while the background color transitions to a new, random hue with each quote's appearance.",
            "technologies": ["HTML", "CSS", "JavaScript"],
            "live_link": "https://carlavid.github.io/random-quote-generator/",
            "github_link": "https://github.com/carlavid/random-quote-generator",
            "image_urls": ["/static/images/quote-generator-1.jpg", "/static/images/quote-generator-2.jpg", "/static/images/quote-generator-3.jpg"]
        },
        {
            "id": 1,
            "project_name": "Data Pagination and Filtering",
            "description": "With a dataset of 42 students, I used pagination to create an interactive 'paging' system, allowing users   to effortlessly explore and view student information across multiple pages. I also incorporated a search feature, enabling users to seamlessly filter through the student data.",
            "technologies": ["HTML", "CSS", "JavaScript"],
            "live_link": "https://carlavid.github.io/data-pagination-and-filtering/",
            "github_link": "https://github.com/carlavid/data-pagination-and-filtering",
            "image_urls": ["/static/images/data-pagination-1.jpg", "/static/images/data-pagination-2.jpg", "/static/images/data-pagination-3.jpg"]
        },
        {
            "id": 2,
            "project_name": "Interactive Form",
            "description": "An app that leverages JavaScript to elevate the interactivity of a registration form designed for a fictional Full Stack conference. I enriched the user experience by introducing my own JavaScript code, instilling the form with custom and context-aware functionality. This includes real-time input validation, insightful error messaging for invalid entries, and the prevention of conflicting activity registrations, all aimed at ensuring a smoother and more user-friendly registration process.",
            "technologies": ["HTML", "CSS", "JavaScript"],
            "live_link": "https://carlavid.github.io/interactive-form/",
            "github_link": "https://github.com/carlavid/interactive-form",
            "image_urls": ["/static/images/interactive-form-1.jpg", "/static/images/interactive-form-2.jpg", "/static/images/interactive-form-3.jpg"]
        },
        {
            "id": 3,
            "project_name": "OOP Game Show App",
            "description": "In this project, I used JavaScript and Object-Oriented Programming to craft a browser-based word guess game. Players aim to decipher a hidden phrase by clicking on either physical or on-screen keyboard keys. After each letter selection, the program cross-references it with the secret phrase. When a match is found, the game board reveals the letter's position. Players continue selecting letters until they either successfully guess the entire phrase and emerge victorious or exceed five incorrect attempts, leading to defeat. If a player manages to solve the phrase before 5 guesses, a winning screen will appear. If they make five incorrect attempts, a losing screen will appear. Importantly, a player can only guess a letter once, and once guessed, it becomes inactive on the on-screen keyboard. ",
            "technologies": ["HTML", "CSS", "JavaScript"],
            "live_link": "https://carlavid.github.io/oop-game/",
            "github_link": "https://github.com/carlavid/oop-game",
            "image_urls": ["/static/images/phrase-hunter-1.jpg", "/static/images/phrase-hunter-2.jpg", "/static/images/phrase-hunter-3.jpg"]
        },
        {
            "id": 4,
            "project_name": "Public API Requests",
            "description": "An app that uses the Random User Generator API (https://randomuser.me/) to grab information for 12 random 'employees' and uses that data to build a prototype for an employee directory.",
            "technologies": ["HTML", "CSS", "JavaScript"],
            "live_link": "https://carlavid.github.io/public-api-requests/",
            "github_link": "https://github.com/carlavid/public-api-requests",
            "image_urls": ["/static/images/employee-directory-1.jpg", "/static/images/employee-directory-2.jpg", "/static/images/employee-directory-3.jpg"]
        }
    ]
}